In [1]:
import pandas as pd
import numpy as np
data3 = pd.read_csv("..//raw//UNEMP_RATE.csv",header=None) #relative path represented as ..
data3.columns=['Date3','unp-rate']
print(data3.columns)

Index(['Date3', 'unp-rate'], dtype='object')

In [2]:
#removed the uncessary 0th index row
data3=data3.drop(index=[0])
data3

          Date3 unp-rate
1    1948-01-01      3.4
2    1948-02-01      3.8
3    1948-03-01      4.0
4    1948-04-01      3.9
5    1948-05-01      3.5
..          ...      ...
919  2024-07-01      4.3
920  2024-08-01      4.2
921  2024-09-01      4.1
922  2024-10-01      4.1
923  2024-11-01      4.2

[923 rows x 2 columns]

In [3]:
data3['Date3'] = pd.to_datetime(data3['Date3'], format='%Y-%m-%d',errors='coerce')
data3['unp-rate']=pd.to_numeric(data3['unp-rate'],errors='coerce') 
data3=data3.dropna(subset=['Date3'])  #drop rows with invalid data
data3

         Date3  unp-rate
1   1948-01-01       3.4
2   1948-02-01       3.8
3   1948-03-01       4.0
4   1948-04-01       3.9
5   1948-05-01       3.5
..         ...       ...
919 2024-07-01       4.3
920 2024-08-01       4.2
921 2024-09-01       4.1
922 2024-10-01       4.1
923 2024-11-01       4.2

[923 rows x 2 columns]

In [4]:
data3.set_index('Date3',inplace=True) 
quarterly3=data3.resample('QE').mean() 
quarterly3.reset_index(inplace=True)  
print(quarterly3)

         Date3  unp-rate
0   1948-03-31  3.733333
1   1948-06-30  3.666667
2   1948-09-30  3.766667
3   1948-12-31  3.833333
4   1949-03-31  4.666667
..         ...       ...
303 2023-12-31  3.733333
304 2024-03-31  3.800000
305 2024-06-30  4.000000
306 2024-09-30  4.200000
307 2024-12-31  4.150000

[308 rows x 2 columns]

In [5]:
quarterly3.to_csv("unemployment.csv", index=False)

In [6]:
quarterly3

         Date3  unp-rate
0   1948-03-31  3.733333
1   1948-06-30  3.666667
2   1948-09-30  3.766667
3   1948-12-31  3.833333
4   1949-03-31  4.666667
..         ...       ...
303 2023-12-31  3.733333
304 2024-03-31  3.800000
305 2024-06-30  4.000000
306 2024-09-30  4.200000
307 2024-12-31  4.150000

[308 rows x 2 columns]